#Область ПрограммныйИнтерфейс

Процедура ДополнитьФорму(Форма) Экспорт
	
	ИмяМассив = СтрРазделить(Форма.ИмяФормы, ".", Ложь);  // определяем название документа
	ИмяДок = ИмяМассив[1];
	ФормаТип = ИмяМассив[3];                              // Используем только формуДокумента
	
	Если ФормаТип = "ФормаДокумента" Тогда
		Если ИмяДок = "ПоступлениеТоваровУслуг" Или ИмяДок = "РеализацияТоваровУслуг" 
				Или ИмяДок = "ЗаказПокупателя" Тогда
			ДобавитьПолеКонтактноеЛицоВШапкаПраво(Форма);
		ИначеЕсли 
			ИмяДок = "ОплатаОтПокупателя" Или ИмяДок = "ОплатаПоставщику" Тогда
			ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма); 
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныйПрограммныйИнтерфейс

Процедура ДобавитьПолеКонтактноеЛицоВШапкаПраво(Форма)
	
	Поле = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	Поле.Вид = ВидПоляФормы.ПолеВвода;
	Поле.ПутьКДанным = "Объект.КонтактноеЛицо";

КонецПроцедуры

Процедура ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма)
	
	Поле = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), , Форма.Элементы.СуммаДокумента);
	Поле.Вид = ВидПоляФормы.ПолеВвода;
	Поле.ПутьКДанным = "Объект.КонтактноеЛицо";
	
КонецПроцедуры
                      
#КонецОбласти